// BlueprintGeneratedClass BP_prem_shop_frontend_01_a.BP_prem_shop_frontend_01_a_C
// Size: 0x598 (Inherited: 0x3c8)
struct ABP_prem_shop_frontend_01_a_C : AActor {
	struct UStaticMeshComponent* bld_prem_frontend_01_a; // 0x3c8(0x08)
	struct UPostProcessComponent* PostProcess; // 0x3d0(0x08)
	struct UBoxComponent* Box; // 0x3d8(0x08)
	struct UStaticMeshComponent* bld_cls_shp_dye_pot_lid_01_a; // 0x3e0(0x08)
	struct UStaticMeshComponent* StaticMesh2; // 0x3e8(0x08)
	struct UStaticMeshComponent* StaticMesh1; // 0x3f0(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x3f8(0x08)
	struct UChildActorComponent* AudioSpace; // 0x400(0x08)
	struct UStaticMeshComponent* bld_tvn_post_01_d; // 0x408(0x08)
	struct UStaticMeshComponent* bld_par_weathervane_01_c; // 0x410(0x08)
	struct UStaticMeshComponent* ptn_resu_01_a3; // 0x418(0x08)
	struct UStaticMeshComponent* ptn_resu_01_a2; // 0x420(0x08)
	struct UStaticMeshComponent* ptn_resu_01_a1; // 0x428(0x08)
	struct UStaticMeshComponent* ptn_resu_01_a; // 0x430(0x08)
	struct UStaticMeshComponent* bld_pot_shop_rack_01_a; // 0x438(0x08)
	struct UStaticMeshComponent* cmn_candle_01_e2; // 0x440(0x08)
	struct UStaticMeshComponent* cmn_candle_01_c1; // 0x448(0x08)
	struct UStaticMeshComponent* cmn_clay_vase_02_a; // 0x450(0x08)
	struct UStaticMeshComponent* bld_prem_shop_rope_details_01_b; // 0x458(0x08)
	struct UStaticMeshComponent* bld_pot_shop_table_bsp_01_a; // 0x460(0x08)
	struct UChildActorComponent* BP_bld_pot_shop_boiler_01_a; // 0x468(0x08)
	struct UStaticMeshComponent* cmn_animal_cage_01_a; // 0x470(0x08)
	struct UStaticMeshComponent* cmn_candle_01_e1; // 0x478(0x08)
	struct UStaticMeshComponent* gmp_bar_stor_01_a; // 0x480(0x08)
	struct UStaticMeshComponent* cap_cabin_trunk_cloth_01_a; // 0x488(0x08)
	struct UStaticMeshComponent* bld_shop_wood_box_03_a1; // 0x490(0x08)
	struct UStaticMeshComponent* bld_shop_wood_box_02_a; // 0x498(0x08)
	struct UStaticMeshComponent* bld_shop_wood_box_03_a; // 0x4a0(0x08)
	struct UStaticMeshComponent* cap_cabin_books_aged_03_a1; // 0x4a8(0x08)
	struct UStaticMeshComponent* cap_cabin_books_03_a1; // 0x4b0(0x08)
	struct UStaticMeshComponent* cap_cabin_books_aged_01_a; // 0x4b8(0x08)
	struct UStaticMeshComponent* cap_cabin_books_aged_03_a; // 0x4c0(0x08)
	struct UStaticMeshComponent* cap_cabin_books_02_a; // 0x4c8(0x08)
	struct UStaticMeshComponent* cap_cabin_books_03_a; // 0x4d0(0x08)
	struct UStaticMeshComponent* cmn_moneybag_01_a1; // 0x4d8(0x08)
	struct UStaticMeshComponent* cmn_clay_vase_01_b; // 0x4e0(0x08)
	struct UStaticMeshComponent* bld_enc_shop_pin_board_01_a; // 0x4e8(0x08)
	struct UStaticMeshComponent* bld_cls_shop_head_stand_01_a; // 0x4f0(0x08)
	struct UStaticMeshComponent* ptn_pois_01_b1; // 0x4f8(0x08)
	struct UStaticMeshComponent* ptn_pois_01_b; // 0x500(0x08)
	struct USkeletalMeshComponent* tls_lantern_01_a3; // 0x508(0x08)
	struct USkeletalMeshComponent* tls_lantern_01_a2; // 0x510(0x08)
	struct UStaticMeshComponent* cmn_candle_01_c; // 0x518(0x08)
	struct UStaticMeshComponent* cmn_candle_01_b; // 0x520(0x08)
	struct UStaticMeshComponent* cmn_bottle_01_a1; // 0x528(0x08)
	struct UStaticMeshComponent* bld_enc_shop_burner_pot_01_a; // 0x530(0x08)
	struct UStaticMeshComponent* bld_int_large_sideboard_03_a; // 0x538(0x08)
	struct UStaticMeshComponent* fod_rum_01_a; // 0x540(0x08)
	struct UStaticMeshComponent* cmn_bottle_01_a; // 0x548(0x08)
	struct UStaticMeshComponent* cmn_moneybag_01_a; // 0x550(0x08)
	struct UStaticMeshComponent* cmn_clay_vase_01_a; // 0x558(0x08)
	struct UStaticMeshComponent* cmn_clay_pot_01_a; // 0x560(0x08)
	struct UStaticMeshComponent* cmn_candle_01_e; // 0x568(0x08)
	struct UStaticMeshComponent* cap_cabin_map_rolls_01_a; // 0x570(0x08)
	struct UStaticMeshComponent* bld_tvn_animal_rug_01_a; // 0x578(0x08)
	struct UStaticMeshComponent* cap_cabin_curtain_03_a; // 0x580(0x08)
	struct UStaticMeshComponent* bld_int_small_shelves_01_a; // 0x588(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x590(0x08)

	void UserConstructionScript(); // Function BP_prem_shop_frontend_01_a.BP_prem_shop_frontend_01_a_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x188c2f0
};

