// BlueprintGeneratedClass BP_tavern_frontend_01_a.BP_tavern_frontend_01_a_C
// Size: 0x848 (Inherited: 0x3c8)
struct ABP_tavern_frontend_01_a_C : AActor {
	struct UStaticMeshComponent* trs_chest_01_c_vc; // 0x3c8(0x08)
	struct UStaticMeshComponent* trs_chest_01_b_vc; // 0x3d0(0x08)
	struct UStaticMeshComponent* trs_chest_01_d_vc; // 0x3d8(0x08)
	struct UStaticMeshComponent* trs_chest_01_a_vc; // 0x3e0(0x08)
	struct UStaticMeshComponent* shp_rope_coil_03_a3; // 0x3e8(0x08)
	struct UStaticMeshComponent* bld_tvn_window_01_b1; // 0x3f0(0x08)
	struct UStaticMeshComponent* fod_rum_01_a; // 0x3f8(0x08)
	struct UParticleSystemComponent* ParticleSystem24; // 0x400(0x08)
	struct UParticleSystemComponent* ParticleSystem23; // 0x408(0x08)
	struct UParticleSystemComponent* ParticleSystem22; // 0x410(0x08)
	struct UStaticMeshComponent* cap_skull_candle_01_a; // 0x418(0x08)
	struct UParticleSystemComponent* ParticleSystem21; // 0x420(0x08)
	struct UParticleSystemComponent* ParticleSystem18; // 0x428(0x08)
	struct UParticleSystemComponent* ParticleSystem17; // 0x430(0x08)
	struct UParticleSystemComponent* ParticleSystem15; // 0x438(0x08)
	struct UParticleSystemComponent* ParticleSystem14; // 0x440(0x08)
	struct UParticleSystemComponent* ParticleSystem12; // 0x448(0x08)
	struct UParticleSystemComponent* ParticleSystem11; // 0x450(0x08)
	struct UParticleSystemComponent* ParticleSystem10; // 0x458(0x08)
	struct UParticleSystemComponent* ParticleSystem9; // 0x460(0x08)
	struct UParticleSystemComponent* ParticleSystem8; // 0x468(0x08)
	struct UParticleSystemComponent* ParticleSystem; // 0x470(0x08)
	struct UStaticMeshComponent* StaticMesh3; // 0x478(0x08)
	struct UStaticMeshComponent* StaticMesh2; // 0x480(0x08)
	struct UStaticMeshComponent* StaticMesh1; // 0x488(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x490(0x08)
	struct UStaticMeshComponent* shp_rope_coil_02_a; // 0x498(0x08)
	struct UStaticMeshComponent* bld_enc_shop_pin_board_01_a; // 0x4a0(0x08)
	struct UParticleSystemComponent* ParticleSystem6; // 0x4a8(0x08)
	struct UStaticMeshComponent* bld_int_wall_coat_rack_01_a; // 0x4b0(0x08)
	struct UStaticMeshComponent* gmp_crew_ledger_01_a; // 0x4b8(0x08)
	struct UStaticMeshComponent* shp_rope_coil_03_a2; // 0x4c0(0x08)
	struct UStaticMeshComponent* tls_tankard_01_b4; // 0x4c8(0x08)
	struct UStaticMeshComponent* tls_tankard_01_b3; // 0x4d0(0x08)
	struct UStaticMeshComponent* cmn_wooden_crate_01_b4; // 0x4d8(0x08)
	struct UStaticMeshComponent* gmp_parchment_scroll_01_b; // 0x4e0(0x08)
	struct UStaticMeshComponent* gmp_parchment_scroll_01_c; // 0x4e8(0x08)
	struct UStaticMeshComponent* bld_tvn_rug_01_a3; // 0x4f0(0x08)
	struct UStaticMeshComponent* bld_shop_rug_01_a; // 0x4f8(0x08)
	struct UStaticMeshComponent* bld_enc_shop_rug_01_a; // 0x500(0x08)
	struct UParticleSystemComponent* ParticleSystem5; // 0x508(0x08)
	struct UParticleSystemComponent* ParticleSystem4; // 0x510(0x08)
	struct UParticleSystemComponent* ParticleSystem3; // 0x518(0x08)
	struct UParticleSystemComponent* ParticleSystem2; // 0x520(0x08)
	struct UParticleSystemComponent* ParticleSystem1; // 0x528(0x08)
	struct UStaticMeshComponent* cmn_candle_01_c3; // 0x530(0x08)
	struct UStaticMeshComponent* cmn_candle_01_a3; // 0x538(0x08)
	struct UStaticMeshComponent* cmn_candle_01_e2; // 0x540(0x08)
	struct UStaticMeshComponent* bld_tvn_bar_arches_01_a; // 0x548(0x08)
	struct UStaticMeshComponent* bld_tvn_drapes_01_a; // 0x550(0x08)
	struct UStaticMeshComponent* wld_blackwyche_picture_01_a; // 0x558(0x08)
	struct UStaticMeshComponent* cap_wooden_plaque_01_a1; // 0x560(0x08)
	struct UStaticMeshComponent* bld_tvn_bar_top_01_a; // 0x568(0x08)
	struct UStaticMeshComponent* bld_tvn_animal_rug_01_a1; // 0x570(0x08)
	struct UStaticMeshComponent* cap_book_stand_01_a1; // 0x578(0x08)
	struct UStaticMeshComponent* bld_tvn_bench_01_a3; // 0x580(0x08)
	struct UStaticMeshComponent* cap_book_stand_01_a; // 0x588(0x08)
	struct UStaticMeshComponent* cmn_wheel_01_a; // 0x590(0x08)
	struct UStaticMeshComponent* tls_tankard_01_b2; // 0x598(0x08)
	struct UStaticMeshComponent* tls_tankard_02_a2; // 0x5a0(0x08)
	struct UStaticMeshComponent* tls_tankard_01_b1; // 0x5a8(0x08)
	struct UStaticMeshComponent* tls_tankard_01_b; // 0x5b0(0x08)
	struct UStaticMeshComponent* tls_tankard_02_a1; // 0x5b8(0x08)
	struct UStaticMeshComponent* tls_tankard_02_a; // 0x5c0(0x08)
	struct UStaticMeshComponent* shp_kitchen_table_01_a1; // 0x5c8(0x08)
	struct UStaticMeshComponent* gmp_bar_hide_01_a6; // 0x5d0(0x08)
	struct UStaticMeshComponent* cmn_candle_01_e1; // 0x5d8(0x08)
	struct UStaticMeshComponent* cmn_candle_01_c2; // 0x5e0(0x08)
	struct UStaticMeshComponent* cmn_candle_01_e; // 0x5e8(0x08)
	struct UStaticMeshComponent* cmn_candle_01_d; // 0x5f0(0x08)
	struct UStaticMeshComponent* cmn_candle_01_a2; // 0x5f8(0x08)
	struct UStaticMeshComponent* cmn_candle_01_c1; // 0x600(0x08)
	struct UStaticMeshComponent* cmn_candle_01_c; // 0x608(0x08)
	struct UStaticMeshComponent* cmn_candle_01_a; // 0x610(0x08)
	struct UStaticMeshComponent* cmn_candle_01_b; // 0x618(0x08)
	struct UStaticMeshComponent* cmn_stool_01_a4; // 0x620(0x08)
	struct UStaticMeshComponent* shp_cook_pot_01_a; // 0x628(0x08)
	struct UStaticMeshComponent* shp_rope_coil_03_a1; // 0x630(0x08)
	struct UStaticMeshComponent* shp_rope_coil_03_a; // 0x638(0x08)
	struct UStaticMeshComponent* trs_plate_01_a8; // 0x640(0x08)
	struct UStaticMeshComponent* trs_plate_01_a7; // 0x648(0x08)
	struct UStaticMeshComponent* trs_plate_01_a6; // 0x650(0x08)
	struct UStaticMeshComponent* trs_plate_01_a5; // 0x658(0x08)
	struct UStaticMeshComponent* trs_plate_01_a4; // 0x660(0x08)
	struct UStaticMeshComponent* trs_plate_01_a3; // 0x668(0x08)
	struct UStaticMeshComponent* trs_plate_01_a2; // 0x670(0x08)
	struct UStaticMeshComponent* trs_plate_01_a1; // 0x678(0x08)
	struct UStaticMeshComponent* trs_plate_01_a; // 0x680(0x08)
	struct UStaticMeshComponent* bld_tvn_ceiling_rose_01_a1; // 0x688(0x08)
	struct UStaticMeshComponent* bld_tvn_ceiling_rose_01_a; // 0x690(0x08)
	struct UStaticMeshComponent* bld_tvn_chandelier_01_a1; // 0x698(0x08)
	struct UStaticMeshComponent* bld_tvn_chandelier_01_a; // 0x6a0(0x08)
	struct UStaticMeshComponent* bld_tvn_bar_barrels_01_b2; // 0x6a8(0x08)
	struct UStaticMeshComponent* bld_tvn_bar_barrels_01_a1; // 0x6b0(0x08)
	struct UStaticMeshComponent* bld_tvn_bar_barrels_01_a; // 0x6b8(0x08)
	struct UStaticMeshComponent* bld_tvn_bar_barrels_01_b1; // 0x6c0(0x08)
	struct UStaticMeshComponent* bld_tvn_bar_barrels_01_b; // 0x6c8(0x08)
	struct UStaticMeshComponent* bld_tvn_bar_racks_01_a; // 0x6d0(0x08)
	struct UStaticMeshComponent* cmn_wooden_crate_01_b3; // 0x6d8(0x08)
	struct UStaticMeshComponent* cmn_wooden_crate_01_b2; // 0x6e0(0x08)
	struct UStaticMeshComponent* cmn_wooden_crate_01_b1; // 0x6e8(0x08)
	struct UStaticMeshComponent* cmn_wooden_crate_01_b; // 0x6f0(0x08)
	struct UStaticMeshComponent* cmn_rowboat_oar_01_a; // 0x6f8(0x08)
	struct UStaticMeshComponent* cmn_rowboat_oar_01_a_3; // 0x700(0x08)
	struct UStaticMeshComponent* gmp_bar_hide_01_a4; // 0x708(0x08)
	struct UStaticMeshComponent* gmp_bar_hide_01_a3; // 0x710(0x08)
	struct UStaticMeshComponent* gmp_bar_hide_01_a2; // 0x718(0x08)
	struct UStaticMeshComponent* gmp_bar_hide_01_a1; // 0x720(0x08)
	struct UStaticMeshComponent* gmp_bar_hide_01_a; // 0x728(0x08)
	struct UStaticMeshComponent* cmn_stool_01_a3; // 0x730(0x08)
	struct UStaticMeshComponent* cmn_stool_01_a2; // 0x738(0x08)
	struct UStaticMeshComponent* cmn_stool_01_a1; // 0x740(0x08)
	struct UStaticMeshComponent* cmn_stool_01_a; // 0x748(0x08)
	struct UStaticMeshComponent* bld_tvn_round_table_01_a1; // 0x750(0x08)
	struct UStaticMeshComponent* bld_tvn_round_table_01_a; // 0x758(0x08)
	struct UStaticMeshComponent* bld_tvn_table_01_a; // 0x760(0x08)
	struct UStaticMeshComponent* bld_tvn_bench_01_a2; // 0x768(0x08)
	struct UStaticMeshComponent* bld_tvn_bench_01_a1; // 0x770(0x08)
	struct UStaticMeshComponent* cmn_rug_01_a2; // 0x778(0x08)
	struct UStaticMeshComponent* cmn_rug_01_a1; // 0x780(0x08)
	struct UStaticMeshComponent* cmn_rug_01_a; // 0x788(0x08)
	struct UStaticMeshComponent* bld_tvn_rug_01_a2; // 0x790(0x08)
	struct UStaticMeshComponent* bld_tvn_rug_01_a1; // 0x798(0x08)
	struct UStaticMeshComponent* bld_tvn_rug_01_a; // 0x7a0(0x08)
	struct UStaticMeshComponent* bld_tvn_animal_rug_01_a; // 0x7a8(0x08)
	struct UStaticMeshComponent* bld_tvn_beam_sail_cloth_01_b; // 0x7b0(0x08)
	struct UStaticMeshComponent* bld_tvn_beam_sail_cloth_01_c; // 0x7b8(0x08)
	struct UStaticMeshComponent* bld_tvn_post_01_b; // 0x7c0(0x08)
	struct UStaticMeshComponent* bld_tvn_bar_base_01_a; // 0x7c8(0x08)
	struct UStaticMeshComponent* bld_tvn_post_01_c1; // 0x7d0(0x08)
	struct UStaticMeshComponent* bld_tvn_bench_01_a; // 0x7d8(0x08)
	struct UStaticMeshComponent* shp_rifle_rack_01_a; // 0x7e0(0x08)
	struct UStaticMeshComponent* bld_tvn_post_01_c; // 0x7e8(0x08)
	struct UStaticMeshComponent* bld_shop_door_02_a1; // 0x7f0(0x08)
	struct UStaticMeshComponent* bld_shop_door_02_a; // 0x7f8(0x08)
	struct UStaticMeshComponent* bld_tvn_exterior_door_01_a; // 0x800(0x08)
	struct UStaticMeshComponent* bld_tvn_window_01_b; // 0x808(0x08)
	struct UStaticMeshComponent* bld_tvn_interior_stairs_01_b; // 0x810(0x08)
	struct UStaticMeshComponent* bld_tvn_fireplace_plinth_01_a; // 0x818(0x08)
	struct UStaticMeshComponent* bld_tvn_fireplace_grate_01_a; // 0x820(0x08)
	struct UStaticMeshComponent* bld_tvn_fireplace_rail_01_a; // 0x828(0x08)
	struct UStaticMeshComponent* bld_tvn_fireplace_surround_01_a; // 0x830(0x08)
	struct UStaticMeshComponent* bld_tavern_frontend_01_a; // 0x838(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x840(0x08)

	void UserConstructionScript(); // Function BP_tavern_frontend_01_a.BP_tavern_frontend_01_a_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x188c2f0
};

